[
  {
    "year": 1904,
    "href": "c029.jpg",
    "caption": "Mill No.2 , Erwin, NC: Fourteen men with prominent positions in the Durham community: (front, left-right) BN Duke, Washington Duke, JB Duke, TJ Walker, AB Carrington, JS Cobb, John Angier; (back) Dr. AG Carr, WA Erwin, JE Stagg, Frank Tate (in charge of building Erwin Mill No. 2), ES Yarbrough, Capt. Lemon (in charge of building Durham & Southern railroad) and FL Fuller"
  },
  {
    "year": 1905,
    "href": "teddy.jpg",
    "caption": "President Teddy Roosevelt speaking in West Durham. Note trolleys on West Main, near Broad Street. In the background is East Campus, with the Erwin Mills just to the left. Photo taken October 19, 1905 on/near the railroad tracks."
  },
  {
    "year": 1915,
    "href": "../duke/duke0205.jpg",
    "caption": "Durham streetcar (1915). Streetcars traveled up Broad Street through Old West Durham."
  },
  {
    "year": 1920,
    "href": "../ninth/Map1925.jpg",
    "caption": "1920 Map of West Durham"
  },
  {
    "year": 1922,
    "href": "erw.JPG",
    "caption": "Erwin Auditorium, built in 1922. It was a recreation center for Erwin Mills employees. Local builder Joe Berini (whose father came to Durham to work as a stone mason at Duke Chapel) spent his childhood in a house on Hillsborough Road -- near Wallace Electric. In the 1920s, Hillsborough was a dirt road and often muddy.  Berini recalls that prior to Durham annexing West Durham in 1925, the neighborhood had running water but no sewage services. As a result, most homes had outhouses in the back yard. He also remembers that Duke's current Central Campus, and along Erwin Road, was a large neighborhood of mill homes. \"Erwin Auditorium was the best thing ever done in Durham,\" Berini said. \"Kids came home from school and had a place to go.\" Finally, Berini recalls people used to fish at the large mill pond on Hillsborough Road (near Carolina Ave). \"They were crazy. You'd never know what was in that water.\"  (Photo courtesy of Historic Preservation Society of Durham)."
  },
  {
    "year": 1929,
    "href": "treesit.jpg",
    "caption": "Tree-Sitter at Dennis's Gas Station. Contest (1929): Crowd congregates around tree located beside gas station to view Arnold Taylor, who sat in the tree for 6-7 weeks competing in a national tree-sitting contest. Event occurred at the corner of Broad & Markham. Note stopped traffic and other commercial stores --cut-rate drug store and quickie take-out. (Source: NC Collection)"
  },
  {
    "year": 1930,
    "href": "/images/history/mill1.jpg",
    "caption": "Erwin Mills.  Mill No. 1"
  }

]